let hiragana = [];

let aHira = [
    ['あ', 'a'],
    ['い', 'i'],
    ['う', 'u'],
    ['え', 'e'],
    ['お', 'u']
];

let kHira = [
    ['か', 'ka'],
    ['き', 'ki'],
    ['く', 'ku'],
    ['け', 'ke'],
    ['こ', 'ko']
];

let sHira = [
    ['さ', 'sa'],
    ['し', 'shi'],
    ['す', 'su'],
    ['せ', 'se'],
    ['そ', 'so']
];

let tHira = [
    ['た', 'ta'],
    ['ち', 'chi'],
    ['つ', 'tsu'],
    ['て', 'te'],
    ['と', 'to']
];

let nHira = [
    ['な', 'na'],
    ['に', 'ni'],
    ['ぬ', 'nu'],
    ['ね', 'ne'],
    ['の', 'no']
];

let hHira = [
    ['は', 'ha'],
    ['ひ', 'hi'],
    ['ふ', 'fu'],
    ['へ', 'he'],
    ['ほ', 'ho']
];

let mHira = [
    ['ま', 'ma'],
    ['み', 'mi'],
    ['む', 'mu'],
    ['め', 'me'],
    ['も', 'mo']
];

let yHira = [
    ['や', 'ya'],
    ['-', '-'],
    ['ゆ', 'yu'],
    ['-', '-'],
    ['よ', 'yo']
];

let rHira = [
    ['ら', 'ra'],
    ['り', 'ri'],
    ['る', 'ru'],
    ['れ', 're'],
    ['ろ', 'ro']
];

let wHira = [
    ['わ', 'wa'],
    ['-', '-'],
    ['を', 'wu'],
    ['-', '-'],
    ['ん', 'n']
];

hiragana.push(rHira);

export {hiragana}
